print("------------------------------------------")
dic = {
    "name": "7D 건조 망고",
    "type": "당절임",
    "ingredient": ["망고", "설탕", "메타중아황산나트륨", "치자황색소"],
    "origin": "필리핀"
}
print("------------------------------------------")
print(dic)
print("------------------------------------------")
print(dic["name"])
print(dic["ingredient"][1])
print("------------------------------------------")
dic["price"] = 5000
print(dic)
print("------------------------------------------")
dic["name"] = "8D 건조 파인애플"
print(dic)
print("------------------------------------------")
del dic["origin"]
print(dic)
print("------------------------------------------")
# ------------------------------------------
# {'name': '7D 건조 망고', 'type': '당절임', 'ingredient': ['망고', '설탕', '메타중아황산나트륨', '치자황색소'], 'origin': '필리핀'}
# ------------------------------------------
# 7D 건조 망고
# 설탕
# ------------------------------------------
# {'name': '7D 건조 망고', 'type': '당절임', 'ingredient': ['망고', '설탕', '메타중아황산나트륨', '치자황색소'], 'origin': '필리핀', 'price': 5000}
# ------------------------------------------
# {'name': '8D 건조 파인애플', 'type': '당절임', 'ingredient': ['망고', '설탕', '메타중아황산나트륨', '치자황색소'], 'origin': '필리핀', 'price': 5000}
# ------------------------------------------
# {'name': '8D 건조 파인애플', 'type': '당절임', 'ingredient': ['망고', '설탕', '메타중아황산나트륨', '치자황색소'], 'price': 5000}
# ------------------------------------------