# -------------------------------------------------
dic = {
    "name": "7D 건조 망고",
    "type": "당절임",
    "ingredient": ["망고", "설탕", "메타중아황산나트륨", "치자황색소"],
    "origin": "필리핀"
}
print("------------------------------------------")
for k in dic:
    print("KEY => " , k, ", Value => ", dic[k])
print("------------------------------------------")
# ------------------------------------------
# KEY =>  name , Value =>  7D 건조 망고
# KEY =>  type , Value =>  당절임
# KEY =>  ingredient , Value =>  ['망고', '설탕', '메타중아황산나트륨', '치자황색소']
# KEY =>  origin , Value =>  필리핀
# ------------------------------------------